#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_filestore_instance.instance will be created
  + resource "google_filestore_instance" "instance" {
      + create_time = (known after apply)
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "test-instance"
      + project     = (known after apply)
      + tier        = "PREMIUM"
      + zone        = "us-west1-a"

      + file_shares {
          + capacity_gb = 5
          + name        = "ghost"
        }

      + networks {
          + ip_addresses      = (known after apply)
          + modes             = [
              + "MODE_IPV4",
            ]
          + network           = "default"
          + reserved_ip_range = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `terraform`, Action: `autotuneterraform-github-actions4`, Working Directory: `.`, Workspace: `staging`*
